import asyncio
import aiohttp

MESSAGE = """
Ребята, отличная новость: расширенная диагностика теперь запущена и уже доступна.

Внутри теперь всё собрано удобнее и понятнее: можно познакомиться с системой, пройти расширенную диагностику, забрать методичку «Потолок внутри», отправить голосовые и записаться на разбор.

Самое важное: это уже не просто набор вопросов. Диагностика помогает увидеть, где у тебя сейчас потолок, куда уходит энергия, что держит на месте, в чём твоя сила и куда двигаться дальше.

По итогам я формирую Карту масштаба — глубокий разбор по твоей ситуации.

Сейчас я на випассане, поэтому всё, что вы отправите, начну разбирать с 8 апреля. Очередь будет идти по приоритету: кто раньше отправил, тот раньше получает обратную связь.

Параллельно уже можно записываться на разборы на ближайшие недели. Окошек немного, поэтому лучше занимать заранее.

И ещё: первым 20 людям расширенная диагностика — бесплатно.

Заходите, знакомьтесь с системой, проходите и бронируйте места. Дальше будем масштабироваться глубже.

Напиши "ДИАГНОСТИКА"
"""
async def send_message(session: aiohttp.ClientSession, token: str, chat_id: str) -> None:
    url = f"https://api.telegram.org/bot{token}/sendMessage"
    reply_markup = {
        "keyboard": [[{"text": "ДИАГНОСТИКА"}]],
        "resize_keyboard": True,
        "one_time_keyboard": True
    }
    async with session.post(url, json={"chat_id": chat_id, "text": MESSAGE, "reply_markup": reply_markup}) as resp:
        data = await resp.json()
        if data.get("ok"):
            print(f"[OK] {chat_id}")
        else:
            print(f"[FAIL] {chat_id}: {data.get('description')}")


async def main(token: str, chat_ids: list[str]) -> None:
    async with aiohttp.ClientSession() as session:
        tasks = [send_message(session, token, cid) for cid in chat_ids]
        await asyncio.gather(*tasks)


if __name__ == "__main__":
    token = "8703431412:AAHiEZaTmTehhZaaLCieHxqZkCSh-JlbemY"
    chat_ids = chat_ids = [
    "5828326482",
    "5088813434",
    "370621610",
    "5662308524",
    "539706590",
    "1325089055",
    "5820754122",
    "1256725793",
    "135462995",
    "7728114014",
    "5674636104",
    "913441815",
    "500613216",
    "354707283",
    "1430699912",
    "1806270154",
    "5258744894",
    "929357483",
    "283645333",
    "976203241",
    "990317436",
    "375316253",
    "931146686",
    "587873684",
    "761041301",
    "1784286734",
    "1297314737",
    "204849216",
    "1415259199",
    "5090256563",
    "5231670552",
    "449924151",
    "503499980",
    "899690514",
    "6900217534",
    "260149955",
    "305909981",
    "1016755230",
    "5682544454",
    "1372910870",
    "349392595",
    "8416147866",
    "996389886",
    "511651138",
    "1459243734",
    "485623477",
    "5422588346",
    "275717061",
    "1089918567",
    "702972436",
    "1168018002",
    "1495779878",
    "788112028",
    "5032231665",
    "903059859",
    "5319079504",
    "898458973",
    "461109053",
    "966425751",
    "148128206",
    "5289803395",
    "1668229639",
    "665550534",
    "420673060",
    "998702252",
    "993879229",
    "686378273",
    "483775660",
    "1189513764",
    "100239624",
    "136041534",
    "857194033",
    "509457389",
    "1210410836",
    "1419889981",
    "189505252",
    "967968185",
    "487922461",
    "8061648899",
    "157811484",
    "782915613",
    "474487991",
    "517813322",
    "424045574",
    "1889257668",
    "473003851",
    "1931654719",
    "85774760",
    "299409760",
    "659279215",
    "241508194",
    "1011959549",
    "487711889",
    "752519280",
    "548138947",
    "781923177",
    "1109752395",
    "154520938",
    "591534830",
    "566245244",
    "483580856",
    "831207080",
    "5752894429",
    "1521304966",
]
    asyncio.run(main(token, chat_ids))
